app/controllers/school_classes_controller.rb

    def index
        @school_classes = SchoolClass.all # show all the school classes
---
SELECT "school_classes".* FROM "school_classes"

    def create
        @school_class = SchoolClass.new(school_class_params(:title, :room_number)) # creating school class with attributes
        @school_class.save # saving the school class
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "CDA 4101"], ["room_number", 241], ["created_at", "2020-03-17 23:35:26.320975"], ["updated_at", "2020-03-17 23:35:26.320975"]]

    def edit
        @school_class = SchoolClass.find(params[:id]) # finding a school class
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
        @school_class = SchoolClass.find(params[:id]) # finding a school class
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @school_class = SchoolClass.find(params[:id]) # finding the school class
        @school_class.update(school_class_params(:title, :room_number)) # updating the school class attributes
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 240], ["updated_at", "2020-03-18 00:13:38.886489"], ["id", 1]]