app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
    def index
        @students = Student.all # show all students

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Oscar "], ["last_name", "Shoudt"], ["created_at", "2020-03-18 00:32:14.379191"], ["updated_at", "2020-03-18 00:32:14.379191"]]
---
    def create
        @student = Student.new(student_params) # creating a student with attributes
        @student.save                                                   # Saving the student

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @student = Student.find(params[:id]) # finding the student

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @student = Student.find(params[:id]) # finding the student